# VS Code extensions
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "christian-kohler.path-intellisense"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.github-actions"
vscode "foxundermoon.shell-format"
vscode "henriiik.docker-linter"
vscode "humao.rest-client"
vscode "jgclark.vscode-todo-highlight"
vscode "jnoortheen.nix-ide"
vscode "naumovs.color-highlight"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "tuttieee.emacs-mcx"
vscode "yusukehirao.vscode-markuplint"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
